//IBMUSER JOB 1,NOTIFY=&SYSUID,REGION=0M
//*------------------------------------------------------------------*
//* STEP 1 : SENDSMS COMPILATION
//*------------------------------------------------------------------*
//COMPSMS  EXEC PGM=IGYCRCTL,REGION=0M,PARM='NOSQL,CICS'
//STEPLIB  DD DSN=IGY520.SIGYCOMP,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//SYSLIB   DD DSN=DFH520.CICS.SDFHCOB,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHMAC,DISP=SHR
//         DD DSN=IBMUSER.CBL,DISP=SHR
//SYSIN    DD DSN=IBMUSER.CBL(SENDSMS),DISP=SHR
//SYSLIN   DD DSN=&&OBJSMS,UNIT=VIO,SPACE=(CYL,(1,1)),DISP=(NEW,PASS)
//SYSPRINT DD SYSOUT=*
//SYSOPTF  DD DATA,DLM='@@'
 RENT
@@
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT5   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT6   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT7   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT8   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT9   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT10  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT11  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT12  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT13  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT14  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT15  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSMDECK DD UNIT=VIO,SPACE=(CYL,(1,1))
//*------------------------------------------------------------------*
//* STEP 1 : MESSAGES COMPILATION
//*------------------------------------------------------------------*
//COMPILE EXEC PGM=IGYCRCTL,REGION=0M,PARM='SQL,CICS'
//STEPLIB  DD DSN=IGY520.SIGYCOMP,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNMACS,DISP=SHR
//SYSLIB   DD DSN=DFH520.CICS.SDFHCOB,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=IBMUSER.CBL(MESSAGES),DISP=SHR
//SYSLIN   DD DSN=&&OBJMOD,UNIT=VIO,SPACE=(CYL,(1,1)),
//            DISP=(NEW,PASS)
//DBRMLIB  DD DSN=IBMUSER.DBRM(MESSAGES),DISP=SHR            
//SYSPRINT DD SYSOUT=*
//SYSOPTF  DD DATA,DLM='@@'
 RENT
@@
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT5   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT6   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT7   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT8   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT9   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT10  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT11  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT12  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT13  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT14  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT15  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSMDECK DD UNIT=VIO,SPACE=(CYL,(1,1))
//*------------------------------------------------------------------*
//* STEP 1 : HISTORY COMPILATION
//*------------------------------------------------------------------*
//COMPHIST EXEC PGM=IGYCRCTL,REGION=0M,PARM='SQL,CICS'
//STEPLIB  DD DSN=IGY520.SIGYCOMP,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNMACS,DISP=SHR
//SYSLIB   DD DSN=DFH520.CICS.SDFHCOB,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=IBMUSER.CBL(HISTORY),DISP=SHR
//SYSLIN   DD DSN=&&OBJHIST,UNIT=VIO,SPACE=(CYL,(1,1)),
//            DISP=(NEW,PASS)
//DBRMLIB  DD DSN=IBMUSER.DBRM(HISTORY),DISP=SHR            
//SYSPRINT DD SYSOUT=*
//SYSOPTF  DD DATA,DLM='@@'
 RENT
@@
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT5   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT6   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT7   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT8   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT9   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT10  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT11  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT12  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT13  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT14  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT15  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSMDECK DD UNIT=VIO,SPACE=(CYL,(1,1))
//*------------------------------------------------------------------*
//* STEP 1 : BALANCE COMPILATION
//*------------------------------------------------------------------*
//COMPBAL  EXEC PGM=IGYCRCTL,REGION=0M,PARM='SQL,CICS'
//STEPLIB  DD DSN=IGY520.SIGYCOMP,DISP=SHR
//         DD DSN=CEE.SCEERUN,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//         DD DSN=DSNB10.SDSNMACS,DISP=SHR
//SYSLIB   DD DSN=DFH520.CICS.SDFHCOB,DISP=SHR
//         DD DSN=DFH520.CICS.SDFHMAC,DISP=SHR
//SYSIN    DD DSN=IBMUSER.CBL(BALANCE),DISP=SHR
//SYSLIN   DD DSN=&&OBJBAL,UNIT=VIO,SPACE=(CYL,(1,1)),
//            DISP=(NEW,PASS)
//DBRMLIB  DD DSN=IBMUSER.DBRM(BALANCE),DISP=SHR            
//SYSPRINT DD SYSOUT=*
//SYSOPTF  DD DATA,DLM='@@'
 RENT
@@
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT2   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT3   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT4   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT5   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT6   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT7   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT8   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT9   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT10  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT11  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT12  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT13  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT14  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSUT15  DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSMDECK DD UNIT=VIO,SPACE=(CYL,(1,1))
//*------------------------------------------------------------------*
//* STEP 2 : LINK MESSAGES
//*------------------------------------------------------------------*
//LKED     EXEC PGM=IEWBLINK,PARM='RENT,MAP',
//         COND=((4,LT,COMPSMS),(4,LT,COMPILE))
//SYSLIB   DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=CEE.SCEELKED,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//SYSLMOD  DD DSN=IBMUSER.LOAD(MESSAGES),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSLIN   DD DSN=&&OBJMOD,DISP=(OLD,DELETE)
//         DD DSN=&&OBJSMS,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFHELII)
 NAME MESSAGES(R)
/*
//*------------------------------------------------------------------*
//* STEP 2 : LINK HISTORY
//*------------------------------------------------------------------*
//LKED     EXEC PGM=IEWBLINK,PARM='RENT,MAP',
//         COND=(4,LT,COMPHIST)
//SYSLIB   DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=CEE.SCEELKED,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//SYSLMOD  DD DSN=IBMUSER.LOAD(HISTORY),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSLIN   DD DSN=&&OBJHIST,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFHELII)
 NAME HISTORY(R)
/*
//*------------------------------------------------------------------*
//* STEP 2 : LINK BALANCE
//*------------------------------------------------------------------*
//LKED     EXEC PGM=IEWBLINK,PARM='RENT,MAP',
//         COND=(4,LT,COMPBAL)
//SYSLIB   DD DSN=DFH520.CICS.SDFHLOAD,DISP=SHR
//         DD DSN=CEE.SCEELKED,DISP=SHR
//         DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//SYSLMOD  DD DSN=IBMUSER.LOAD(BALANCE),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=VIO,SPACE=(CYL,(1,1))
//SYSLIN   DD DSN=&&OBJBAL,DISP=(OLD,DELETE)
//         DD *
 INCLUDE SYSLIB(DFHELII)
 NAME BALANCE(R)
/*
//*------------------------------------------------------------------*
//* STEP 3 : BIND
//*------------------------------------------------------------------*
//BIND EXEC PGM=IKJEFT01
//STEPLIB DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//DBRMLIB DD DSN=IBMUSER.DBRM,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM(DBBG)
 BIND PLAN(MESSAGES) -
  MEMBER(MESSAGES) -
  ACTION(REPLACE) -
  ENCODING(EBCDIC) -
  ISOLATION(CS)
 BIND PLAN(HISTORY) -
  MEMBER(HISTORY) -
  ACTION(REPLACE) -
  ENCODING(EBCDIC) -
  ISOLATION(CS)
 BIND PLAN(BALANCE) -
  MEMBER(BALANCE) -
  ACTION(REPLACE) -
  ENCODING(EBCDIC) -
  ISOLATION(CS)
 END 
/*
