//IBMUSER JOB (ACCOUNT),'SQL INSTALL',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*------------------------------------------------------------------*
//* DDL (DATA DEFINITION LANGUAGE) INSTALLATION FOR ZSMSGATEWAY      *
//* THIS JOB DEFINES THE DATABASE STRUCTURE                          *
//*------------------------------------------------------------------*
//* STEP 1: CLEANUP - DROP DATABASE AND ALL CHILD OBJECTS            *
//*------------------------------------------------------------------*
//DROPSTEP EXEC PGM=DSNUTILB,REGION=0M,PARM='DBBG,SQLDROP'
//STEPLIB  DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  EXEC SQL DROP DATABASE ZSMS ENDEXEC
  EXEC SQL COMMIT ENDEXEC
/*
//*------------------------------------------------------------------*
//* STEP 2: DDL EXECUTION - CREATE DATABASE, TABLESPACE AND TABLE    *
//* RUNS EVEN IF STEP 1 FAILS (E.G. DATABASE DOES NOT EXIST YET)     *
//*------------------------------------------------------------------*
//CREASTEP EXEC PGM=DSNUTILB,REGION=0M,PARM='DBBG,SQLCREA',
//         COND=EVEN 
//STEPLIB  DD DSN=DSNB10.SDSNLOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  -- 1. DEFINE THE MAIN DATABASE CONTAINER
  EXEC SQL 
    CREATE DATABASE ZSMS
  ENDEXEC
  -- 2. DEFINE THE PHYSICAL STORAGE AREA (TABLESPACE)
  EXEC SQL 
    CREATE TABLESPACE ZSMSTS01 IN ZSMS
      USING STOGROUP SYSDEFLT 
      PRIQTY 5000 SECQTY 1000 LOCKSIZE ROW 
  ENDEXEC
  -- 3. TABLE FOR USERS (WEB GENERATED ID)
  EXEC SQL 
    CREATE TABLE ZSMS_USERS (
      USER_ID       INTEGER  NOT NULL,
      EMAIL         VARCHAR(50) NOT NULL,
      CREDIT_AMOUNT INTEGER NOT NULL WITH DEFAULT 0,
      CREATED_AT    TIMESTAMP    NOT NULL WITH DEFAULT,
      CONSTRAINT PK_ZSMSUSERS PRIMARY KEY (USER_ID)
    ) IN ZSMS.ZSMSTS01    
  ENDEXEC
  -- IMPORTANT: INDEX FOR USERS PRIMARY KEY
  EXEC SQL
    CREATE UNIQUE INDEX IX_USERS_PK ON ZSMS_USERS (USER_ID)
  ENDEXEC    
  -- 4. DEFINE THE LOGICAL TABLE STRUCTURE
  EXEC SQL 
    CREATE TABLE ZSMS_MESSAGES (
      MSG_ID      INTEGER      NOT NULL,
      USER_ID     INTEGER  NOT NULL, 
      PHONE_NUM   VARCHAR(20)  NOT NULL,
      MSG_TEXT    VARCHAR(1000) NOT NULL,
      NB_SMS      INTEGER      NOT NULL WITH DEFAULT 0,
      STATUS      INTEGER      NOT NULL WITH DEFAULT -200,
      CREATED_AT  TIMESTAMP    NOT NULL WITH DEFAULT,
      TRACKING_ST  CHAR(5) NOT NULL WITH DEFAULT '0',
  --    CONSTRAINT  PK_ZSMSMSGS PRIMARY KEY (MSG_ID),
      CONSTRAINT  FK_MSG_USER FOREIGN KEY (USER_ID) 
          REFERENCES ZSMS_USERS (USER_ID) ON DELETE RESTRICT
    ) IN ZSMS.ZSMSTS01
  ENDEXEC
  -- IMPORTANT: INDEX FOR MESSAGES PRIMARY KEY
  EXEC SQL
    CREATE INDEX IX_MSGS_PK ON ZSMS_MESSAGES (MSG_ID)
  ENDEXEC
  -- INDEX FOR HISTORY SORTING (USER + DATE)
  EXEC SQL
   CREATE INDEX IX_MSGS_SORT ON ZSMS_MESSAGES (USER_ID,CREATED_AT DESC)
  ENDEXEC
  EXEC SQL COMMIT ENDEXEC
/*
